[{
	"name2": "HISTORY OF COMPUTING",
	"species2": "Identifying concrete devices used in computing. Concept of Number System in computing",
	"description2": "14th C. - Abacus - an instrument for performing calculations by sliding counters along rods or in grooves .(graphic: Merriam Webster Collegiate Dictionary http://www.m-w.com/mw/art/abacus.htm).17th /n/nC. - Slide rule -  a manual device used for calculation that consists in its simple form of a ruler and a movable middle piece which are graduated with similar logarithmic scales (Picture from the The Museum of HP Calculators)/n/n    1642 - Pascaline--a mechanical calculator built by Blaise Pascal, a 17th century mathematician, for whom the Pascal computer programming language was named ./n/n1804 - Jacquard loom - a loom programmed with punched cards invented by Joseph Marie Jacquard/n/nca 1850 - Difference Engine , Analytical Engine - Charles Babbage and Ada Byron (See her picture.). Babbage's description, in 1837, of the Analytical Engine, a hand cranked, mechanical digital computer anticipated virtually every aspect of present-day computers. /n/nIt wasn\t until over a 100  years later that another all purpose computer was conceived. Sketch of the Engine and notes by Ada Byron King, Countess of  Lovelace.  /n/n 1939 -1942 - Atanasoff Berry Computer -  built at Iowa State by Prof. John V. Atanasoff and graduate student Clifford Berry.  Represented several firsts  in computing, including a binary system of of arithmetic, parallel processing, regenerative memory, separation of memory and computing functions, and more. Weighed 750 lbs. and had a memory storage of 3,000 bits (0.4K). Recorded numbers by scorching marks into cards as it worked through a problem. Colossus - a vacuum tube computing machine which broke Hitlers codes during WW II. \n\nIt was instrumental in helping Turing break the German/s codes during WW II to turn the tide of the war. In the summer of 1939, a small group of scholars became codebreakers, working at Bletchley Part in England.  This group of pioneering codebreakers helped shorten the war and changed the course of history.  See the the Bletchley Park Web site and its history.  See more information on Codes and Ciphers in the Second World War at Tony Sales site.",
	"image": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/abacha.jpg"
}, {
	"name2": "HISTORY OF COMPUTING PART 2",
	"species2": "ENIAC, UNIVAC AND IBM",
	"description2": "1946 - ENIAC - World/s first electronic, large scale, general-purpose computer, built by Mauchly and Eckert, and activated at the University of Pennsylvania in 1946. ENIAC recreated on a modern computer chip.  See an explanation of ENIAC on a Chip by the Moore School of Electrical Engineering, University of Pennsylvania. The ENIAC is a 30 ton machine that measured 50 x 30 feet. It contained 19,000 vacuum tubes, 6000 switches, and could add 5,000 numbers in a second, a remarkable accomplishment at the time. /n/nA reprogrammable machine, the ENIAC performed initial calculations for the H-bomb.  It was also used to prepare artillery shell trajectory tables and perform other military and scientific calculations. Since there was no software to reprogram the computer, people had to rewire it to get it to perform different functions.  The human programmers had to read wiring diagrams and know what each switch did. J. Presper Eckert, Jr. and John W. Mauchly drew on Alansoff's work to create the ENIAC, the Electronic Numerical Integrator and Computer./n/n 1951-1959 - vacuum tube based technology. Vacuum Tubes are electronic devices, consisting of a glass or steel vacuum envelope and two or more electrodes between which electrons can move freely. First commercial computers used vacuum tubes: Univac, IBM 701./n/n1950s -1960s - UNIVAC - punch card technology The first commercially successful computer, introduced in 1951 by Remington Rand. Over 40 systems were sold. Its memory was made of mercury filled acoustic delay lines that held 1,000 12 digit numbers. It used magnetic tapes that stored 1MB of data at a density of 128 cpi. UNIVAC became synonymous with computer (for a while). See UNIVAC photo . See UNIVAC flow chart /n/n 1960 IBM 1620 - See photos at The Computer History Museum./n/n    1960-1968 - transistor based technology. The transistor, invented in 1948, by Dr. John Bardeen, Dr. Walter Brattain, and Dr. William Shockley . It almost completely replaced the vacuum tube because of its reduced cost, weight, and power consumption and its higher reliability. See explanation and diagram of a transistor and what the first transistor looked like. The transistor is made to alter its state from a starting condition of conductivity (switched 'on', full current flow) to a final condition of insulation (switched 'off', no current flow).",
	"thumbnail2": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/thumbnail_abdulsalam.jpg",
	"image": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/abdulsalam.jpg"
}, {
	"name2": "HISTORY OF COMPUTING PART 3",
	"species2": "TRANSISTOR, INTERNET AND INTEGRATED CIRCUIT",
	"description2": "1969 - The Internet, originally the ARPAnet (Advanced Research Projects Agency network), began as a military computer network./n/n 1969-1977 - integrated circuits (IC) based technology.  The first integrated circuit was demonstrated by Texas Instruments inventor, Jack Kilby, in 1958. It was 7/16 wide and contained two transistors.Examples of early integrated circuit technology: Intel 4004, Dec pdp 8, CRAY 1(1976) - a 75 MHz, 64 - bit machine with a peak speed of 160 megaflops, (One million floating point operations per second) the world /s fastest processor at that time. Now circuits may contain hundreds of thousands of transistors on a small piece of material, which revolutionized computing.  Here is a diagram of a modern integrated circuit, known as a chip./n/n1976 - CRAY 1 - The world/s first electronic digital computer, developed in 1946. A 75 MHz, 64 - bit machine with a peak speed of 160 megaflops, (one million floating point operations per second) the world /s fastest processor at that time./n/n976 - Apples/MACs - The Apple was designed by Steve Wozniak and Steve Jobs. Apple was the first to have a windows type graphical interface and the computer mouse. Like modern computers, early Apples had a peripheral keyboard and mouse, and had a floppy drive that held 3.5 disks.The Macintosh replaced the Apple.See a picture of the The Apple III(1980 - 1985). / n / n1978 to 1986 - large scale integration(LSI);Alto - early workstation with mouse;Apple, designed by Steve Wozniak and Steve Jobs.Apple was the first to have a windows type graphical interface and the computer mouse.See Apple / MACs evolution over time.The PC and clone market begins to expand.This begins first mass market of desktop computers",

	"thumbnail2": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/thumbnail_obasanjo.jpg",
	"image": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/obasanjo.jpg"
}, {
	"name2": "HISTORY OF COMPUTING PART 4",
	"species2": "(INTERNET AND WORLD WIDE WEB).",
	"description2": "1986 to today - the age of the networked computing, the Internet, and the WWW./n/n1990 - Tim Berners-Lee invented the networked hypertext system called the World Wide Web./n/n1992 - Bill Gates' Microsoft Corp. released Windows 3.1, an operating system that made IBM and IBM-compatible PCs more user-friendly by integrating a graphical user interface into the software. In replacing the old Windows command-line system, however, Microsoft created a program similar to the Macintosh operating system. Apple sued for copyright infringement, but Microsoft prevailed.  Windows 3.1 went to Win 95, then Win 98, now Windows XP .... (There are other OSs, of course, but Windows is the dominant OS today. MACs, by Apple, still have a faithful following.  Linux has a faithful following./n/n1995 - large commercial Internet service providers (ISPs), such as MCI, Sprint , AOL and UUNET, began offering service to large number of customers. /n/n    1996 - Personal Digital Assistants (such as the Palm Pilot became available to consumers.  They can do numeric calculations, play games and music and download information from the Internet.  See How Stuff Works for a history and details. ",
	"thumbnail2": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/thumbnail_yar-adua.jpg",
	"image": "https://raw.githubusercontent.com/oduswale/NigeriaLeaders/master/images/exhibits/yar-adua.jpg"
}]
